// js/notification-data.js

// এটি নোটিফিকেশনগুলির একটি অ্যারে।
// প্রতিটি নোটিফিকেশনের একটি অনন্য 'id', একটি 'message' এবং একটি 'date' থাকবে।

const notifications = [
    {
        id: 1,
        message: "সকল ছাত্র-ছাত্রীদের জন্য রইল আমার আন্তরিক ভালোবাসা ও শুভকামনা।",
        date: "2025-07-31"
    },
    {
        id: 2,
        message: "মনিশঙ্কর ওয়েবসাইটটা ব্যবহার করে কেমন লাগছে? নিচের ফিডব্যাক পেজে তোমার রিভিউ দাও!",
        date: "2025-07-31"
    }
];

// এই ফাইলটি notification.js দ্বারা লোড হবে এবং 'notifications' অ্যারেটি ব্যবহার করা হবে।