// js/notification-data.js

// এটি নোটিফিকেশনগুলির একটি অ্যারে।
// প্রতিটি নোটিফিকেশনের একটি অনন্য 'id', একটি 'message' এবং একটি 'date' থাকবে।

const notifications = [
    {
        id: 100,
        message: "ফিজিক্স সাবজেক্টের ‘কর্ম ও শক্তি’ অধ্যায়টি সম্পূর্ণভাবে আপডেট করা হয়েছে। এখন তুমি কুইজের মাধ্যমে নিজের মেধা যাচাই করতে পারবে। রিভিশন সিরিজের নোটগুলো মনোযোগ দিয়ে পড়লে আশা করি ‘কর্ম, ক্ষমতা ও শক্তি’ অধ্যায় থেকে যেকোনো প্রশ্নের সঠিক উত্তর দিতে সক্ষম হবে। কুইজ সিরিজে বিভিন্ন চাকরির পরীক্ষার প্রিভিয়াস ইয়ার প্রশ্নও যুক্ত করা হয়েছে। চল, এখনই রিভিশন শুরু করি!",
        date: "2025-08-02"
    }
];

// এই ফাইলটি notification.js দ্বারা লোড হবে এবং 'notifications' অ্যারেটি ব্যবহার করা হবে।